package me.heaton.jp

trait Syllabary {

  // ひらがな
  val hiragana = Map(
    "あ" -> "a", "い" -> "i", "う" -> "u", "え" -> "e", "お" -> "o",
    "か" -> "ka", "き" -> "ki", "く" -> "ku", "け" -> "ke", "こ" -> "ko", "きゃ" -> "kya", "きゅ" -> "kyu", "きょ" -> "kyo",
    "さ" -> "sa", "し" -> "shi", "す" -> "su", "せ" -> "se", "そ" -> "so", "しゃ" -> "sha", "しゅ" -> "shu", "しょ" -> "sho",
    "た" -> "ta", "ち" -> "chi", "つ" -> "tsu", "て" -> "te", "と" -> "to", "ちゃ" -> "cha", "ちゅ" -> "chu", "ちょ" -> "cho",
    "な" -> "na", "に" -> "ni", "ぬ" -> "nu", "ね" -> "ne", "の" -> "no", "にゃ" -> "nya", "にゅ" -> "nyu", "にょ" -> "nyo",
    "は" -> "ha", "ひ" -> "hi", "ふ" -> "fu", "へ" -> "he", "ほ" -> "ho", "ひゃ" -> "hya", "ひゅ" -> "hyu", "ひょ" -> "hyo",
    "ま" -> "ma", "み" -> "mi", "む" -> "mu", "め" -> "me", "も" -> "mo", "みゃ" -> "mya", "みゅ" -> "myu", "みょ" -> "myo",
    "や" -> "ya", "ゆ" -> "yu", "よ" -> "yo",
    "ら" -> "ra", "り" -> "ri", "る" -> "ru", "れ" -> "re", "ろ" -> "ro", "りゃ" -> "rya", "りゅ" -> "ryu", "りょ" -> "ryo",
    "わ" -> "wa", "を" -> "o",
    "ん" -> "n",
    "が" -> "ga", "ぎ" -> "gi", "ぐ" -> "gu", "げ" -> "ge", "ご" -> "go", "ぎゃ" -> "gya", "ぎゅ" -> "gyu", "ぎょ" -> "gyo",
    "ざ" -> "za", "じ" -> "ji", "ず" -> "zu", "ぜ" -> "ze", "ぞ" -> "zo", "じゃ" -> "ja", "じゅ" -> "ju", "じょ" -> "jo",
    "だ" -> "da", "ぢ" -> "ji", "づ" -> "zu", "で" -> "de", "ど" -> "do",
    "ば" -> "ba", "び" -> "bi", "ぶ" -> "bu", "べ" -> "be", "ぼ" -> "bo", "びゃ" -> "bya", "びゅ" -> "byu", "びょ" -> "byo",
    "ぱ" -> "pa", "ぴ" -> "pi", "ぷ" -> "pu", "ぺ" -> "pe", "ぽ" -> "po", "ぴゃ" -> "pya", "ぴゅ" -> "pyu", "ぴょ" -> "pyo"
  )

  // カタカナ
  val katakana = Map(
    "ア" -> "a", "イ" -> "i", "ウ" -> "u", "エ" -> "e", "オ" -> "o",
    "カ" -> "ka", "キ" -> "ki", "ク" -> "ku", "ケ" -> "ke", "コ" -> "ko", "キャ" -> "kya", "キュ" -> "kyu", "キョ" -> "kyo",
    "サ" -> "sa", "シ" -> "shi", "ス" -> "su", "セ" -> "se", "ソ" -> "so", "シャ" -> "sha", "シュ" -> "shu", "ショ" -> "sho",
    "タ" -> "ta", "チ" -> "chi", "ツ" -> "tsu", "テ" -> "te", "ト" -> "to", "チャ" -> "cha", "チュ" -> "chu", "チョ" -> "cho",
    "ナ" -> "na", "ニ" -> "ni", "ヌ" -> "nu", "ネ" -> "ne", "ノ" -> "no", "ニャ" -> "nya", "ニュ" -> "nyu", "ニョ" -> "nyo",
    "ハ" -> "ha", "ヒ" -> "hi", "フ" -> "fu", "ヘ" -> "he", "ホ" -> "ho", "ヒャ" -> "hya", "ヒュ" -> "hyu", "ヒョ" -> "hyo",
    "マ" -> "ma", "ミ" -> "mi", "ム" -> "mu", "メ" -> "me", "モ" -> "mo", "ミャ" -> "mya", "ミュ" -> "myu", "ミョ" -> "myo",
    "ヤ" -> "ya", "ユ" -> "yu", "ヨ" -> "yo",
    "ラ" -> "ra", "リ" -> "ri", "ル" -> "ru", "レ" -> "re", "ロ" -> "ro", "リャ" -> "rya", "リュ" -> "ryu", "リョ" -> "ryo",
    "ワ" -> "wa", "ヲ" -> "o",
    "ン" -> "n",
    "が" -> "ga", "ぎ" -> "gi", "ぐ" -> "gu", "げ" -> "ge", "ご" -> "go", "ギャ" -> "gya", "ギュ" -> "gyu", "ギョ" -> "gyo",
    "ざ" -> "za", "じ" -> "ji", "ず" -> "zu", "ぜ" -> "ze", "ぞ" -> "zo", "ジャ" -> "ja", "ジュ" -> "ju", "ジョ" -> "jo",
    "だ" -> "da", "ぢ" -> "ji", "づ" -> "zu", "で" -> "de", "ど" -> "do",
    "ば" -> "ba", "び" -> "bi", "ぶ" -> "bu", "べ" -> "be", "ぼ" -> "bo", "ビャ" -> "bya", "ビュ" -> "byu", "ビョ" -> "byo",
    "ぱ" -> "pa", "ぴ" -> "pi", "ぷ" -> "pu", "ぺ" -> "pe", "ぽ" -> "po", "ピャ" -> "pya", "ピュ" -> "pyu", "ピョ" -> "pyo"
  )

  val words = Map(
    "日本" -> "日本",
    "我" -> "私",
    "樱花" -> "桜"
  )
}
